import { useNavigate } from "react-router-dom";
import React from "react";


const PrivacyPolicy = () => {
  const navigate = useNavigate();
  return (
    <div dir="rtl" className="max-w-5xl mx-auto p-6 leading-loose text-right"><br></br>
      <h1 className="text-3xl font-bold mb-6"> תנאי שימוש לאתר "NAME"</h1>
       <p className="mb-4">
        המונח "האתר" מתייחס לכל דפי האתר, דפי נחיתה, ותכנים דיגיטליים נוספים הקשורים אליו.
      </p>
      <p className="mb-4">
        האתר מספק תוכן בנושאי כלכלה, ביטוח ופיננסים. כל שימוש באתר, לרבות עיון בתכנים, מהווה הסכמה לתנאי השימוש והמדיניות שלהלן.
      </p>
      <p className="mb-4">
        אם אינך מסכים לתנאים אלה, אנא הימנע משימוש באתר.
      </p>
      <p className="mb-4">
        תנאים אלו מנוסחים בלשון זכר לנוחות בלבד, והם מתייחסים לכל המגדרים.
      </p>
      <p className="mb-4">
        האתר ניתן לשימוש כמות שהוא (AS IS), והמפעיל לא ישא באחריות להתאמה אישית, תקלות או מגבלות העלולות להיווצר למשתמש.
      </p>
      <p className="mb-4">
        אין המפעיל אחראי לכל נזק ישיר או עקיף שעלול להיגרם למשתמש כתוצאה מהשימוש באתר או מהסתמכות על התכנים שבו.
      </p>
      <p className="mb-4">
        ייתכן שהאתר יכיל קישורים לאתרים חיצוניים. אין המפעיל אחראי על תוכן אתרים אלו או על מדיניות הפרטיות שלהם.
      </p>
      <p className="mb-4">
        המידע המופיע באתר אינו מהווה ייעוץ מקצועי ואינו מהווה תחליף להתייעצות עם בעל מקצוע מוסמך.
      </p>
      <p className="mb-4">
        כל הזכויות בתכני האתר שמורות למפעיל. אין לשכפל, להפיץ, לפרסם או להשתמש בתכנים ללא קבלת אישור מראש ובכתב.
      </p>
      <p className="mb-4">
        המפעיל רשאי לעדכן את תנאי השימוש, מבנה האתר או התוכן בכל עת, וללא צורך בהודעה מוקדמת. שימוש מתמשך באתר מהווה הסכמה לתנאים המעודכנים.
      </p>
      <p className="mb-4">
        על השימוש באתר יחול הדין הישראלי בלבד, וכל מחלוקת תידון בבתי המשפט המוסמכים באזור תל אביב.
      </p>

            <div className="mt-8 text-center">
<button className="back-button" onClick={() => navigate("/")}>
  חזרה לדף הבית
</button>
      </div>
    </div>
  );
};

export default PrivacyPolicy;